Documents/Лео_ФактТрудозатрат/Лео_ФактТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ФактТрудозатрат</name>
  <basedOn>Document.ОтчетПроизводстваЗаСмену</basedOn>
  <registerRecords>AccumulationRegister.Лео_ФакТрудозатрат</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Лео_сменыПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОборудования</name>
      <type>
        <types>CatalogRef.Лео_оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехнологическаяОперация</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_Простои</name>
      <type>
        <types>CatalogRef.Лео_Простои</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/Лео_ФактТрудозатрат/Forms/ФормаДокумента2/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
	
	ДокументОснование = Объект.ДокументОснование;
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		Если НоваяСтрока и НЕ Копирование тогда
			
			Элемент.ТекущиеДанные.Смена = Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000002"); //8 часов
			Элемент.ТекущиеДанные.Подразделение = ДокументОснование.Подразделение;
			Элемент.ТекущиеДанные.ВидОборудования = ДокументОснование.Лео_оборудование;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
	
	ФизЛицо = Элемент.ТекущиеДанные.ФизЛицо;
	Если ЗначениеЗаполнено(ФизЛицо) и НоваяСтрока тогда
		Элемент.ТекущиеДанные.Должность = ФизЛицо.Лео_Должность;
		
		Если ФизЛицо.Родитель.Код = "БП00002643" тогда
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0010883"); //Группа линейного персонала ООО	
			//переработчики	
		ИначеЕсли ФизЛицо.Родитель.Код = "БП00000960" тогда
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0007666"); //ПРОФЕССИОНАЛ СТАФФ ООО
			
		иначе
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("К00000011"); //ЛЕОВИТ нутрио
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
